; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v2 ?v10)
             (pred_1 ?v12 ?v11)
             (pred_3 ?v2 ?v11)
             (pred_7 ?v4 ?v2 )
	     (pred_11 ?v2)
             (pred_10 ?v8)
             (pred_4 ?v12)
             (pred_8 ?v11)
             (pred_6 ?v2)
             (pred_5 ?v12)
             (pred_2 ?v2)
             (pred_12 ))



(:action op_2
:parameters (?v6 ?v5 ?v9 ?v13)
:precondition (and (pred_10 ?v6) (pred_10 ?v5) (pred_4 ?v9) (pred_8 ?v13)
          (pred_9 ?v6 ?v5) (pred_1 ?v9 ?v13)
                   (pred_3 ?v5 ?v13) (pred_11 ?v6) 
                   (pred_6 ?v5) (pred_5 ?v9))
:effect (and  (pred_2 ?v5) (not (pred_6 ?v5))))


(:action op_1
:parameters (?v6 ?v7)
:precondition (and (pred_10 ?v6) (pred_10 ?v7)
               (pred_11 ?v6) (pred_9 ?v6 ?v7) (pred_2 ?v7))
:effect (and (pred_11 ?v7) (not (pred_11 ?v6))))

(:action op_4
:parameters (?v6 ?v9)
:precondition (and (pred_10 ?v6) (pred_4 ?v9) 
                  (pred_11 ?v6) (pred_7 ?v9 ?v6) (pred_12 ))
:effect (and (pred_5 ?v9)
   (not (pred_7 ?v9 ?v6)) (not (pred_12 ))))


(:action op_5
:parameters (?v6 ?v1 ?v3)
:precondition (and (pred_10 ?v6) (pred_4 ?v1) (pred_4 ?v3)
                  (pred_11 ?v6) (pred_5 ?v3) (pred_7 ?v1 ?v6))
:effect (and (pred_5 ?v1) (pred_7 ?v3 ?v6)
        (not (pred_5 ?v3)) (not (pred_7 ?v1 ?v6))))

(:action op_3
:parameters (?v6 ?v9)
:precondition (and (pred_10 ?v6) (pred_4 ?v9) 
                  (pred_11 ?v6) (pred_5 ?v9))
:effect (and (pred_12 ) (pred_7 ?v9 ?v6) (not (pred_5 ?v9)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_02 obj_19 obj_25 obj_22 obj_20 obj_17 obj_07 obj_28 obj_06 obj_05 obj_03 obj_12 obj_21 obj_15 obj_04 obj_13 obj_01 obj_08 obj_27 obj_16 obj_23 obj_14 obj_10 obj_09 obj_26
    obj_30 obj_11
    obj_29 obj_24 obj_18
    )

    (:init
       (pred_12)

       (pred_10 obj_02)
       (pred_10 obj_19)
       (pred_10 obj_25)
       (pred_10 obj_22)
       (pred_10 obj_20)
       (pred_10 obj_17)
       (pred_10 obj_07)
       (pred_10 obj_28)
       (pred_10 obj_06)
       (pred_10 obj_05)
       (pred_10 obj_03)
       (pred_10 obj_12)
       (pred_10 obj_21)
       (pred_10 obj_15)
       (pred_10 obj_04)
       (pred_10 obj_13)
       (pred_10 obj_01)
       (pred_10 obj_08)
       (pred_10 obj_27)
       (pred_10 obj_16)
       (pred_10 obj_23)
       (pred_10 obj_14)
       (pred_10 obj_10)
       (pred_10 obj_09)
       (pred_10 obj_26)
       (pred_8 obj_30)
       (pred_8 obj_11)
       (pred_4 obj_29)
       (pred_4 obj_24)
       (pred_4 obj_18)

       (pred_9 obj_02 obj_17)
       (pred_9 obj_02 obj_19)
       (pred_9 obj_19 obj_07)
       (pred_9 obj_19 obj_25)
       (pred_9 obj_19 obj_02)
       (pred_9 obj_25 obj_28)
       (pred_9 obj_25 obj_22)
       (pred_9 obj_25 obj_19)
       (pred_9 obj_22 obj_06)
       (pred_9 obj_22 obj_20)
       (pred_9 obj_22 obj_25)
       (pred_9 obj_20 obj_05)
       (pred_9 obj_20 obj_22)
       (pred_9 obj_17 obj_03)
       (pred_9 obj_17 obj_07)
       (pred_9 obj_17 obj_02)
       (pred_9 obj_07 obj_12)
       (pred_9 obj_07 obj_28)
       (pred_9 obj_07 obj_19)
       (pred_9 obj_07 obj_17)
       (pred_9 obj_28 obj_21)
       (pred_9 obj_28 obj_06)
       (pred_9 obj_28 obj_25)
       (pred_9 obj_28 obj_07)
       (pred_9 obj_06 obj_15)
       (pred_9 obj_06 obj_05)
       (pred_9 obj_06 obj_22)
       (pred_9 obj_06 obj_28)
       (pred_9 obj_05 obj_04)
       (pred_9 obj_05 obj_20)
       (pred_9 obj_05 obj_06)
       (pred_9 obj_03 obj_13)
       (pred_9 obj_03 obj_12)
       (pred_9 obj_03 obj_17)
       (pred_9 obj_12 obj_01)
       (pred_9 obj_12 obj_21)
       (pred_9 obj_12 obj_07)
       (pred_9 obj_12 obj_03)
       (pred_9 obj_21 obj_08)
       (pred_9 obj_21 obj_15)
       (pred_9 obj_21 obj_28)
       (pred_9 obj_21 obj_12)
       (pred_9 obj_15 obj_27)
       (pred_9 obj_15 obj_04)
       (pred_9 obj_15 obj_06)
       (pred_9 obj_15 obj_21)
       (pred_9 obj_04 obj_16)
       (pred_9 obj_04 obj_05)
       (pred_9 obj_04 obj_15)
       (pred_9 obj_13 obj_23)
       (pred_9 obj_13 obj_01)
       (pred_9 obj_13 obj_03)
       (pred_9 obj_01 obj_14)
       (pred_9 obj_01 obj_08)
       (pred_9 obj_01 obj_12)
       (pred_9 obj_01 obj_13)
       (pred_9 obj_08 obj_10)
       (pred_9 obj_08 obj_27)
       (pred_9 obj_08 obj_21)
       (pred_9 obj_08 obj_01)
       (pred_9 obj_27 obj_09)
       (pred_9 obj_27 obj_16)
       (pred_9 obj_27 obj_15)
       (pred_9 obj_27 obj_08)
       (pred_9 obj_16 obj_26)
       (pred_9 obj_16 obj_04)
       (pred_9 obj_16 obj_27)
       (pred_9 obj_23 obj_14)
       (pred_9 obj_23 obj_13)
       (pred_9 obj_14 obj_10)
       (pred_9 obj_14 obj_01)
       (pred_9 obj_14 obj_23)
       (pred_9 obj_10 obj_09)
       (pred_9 obj_10 obj_08)
       (pred_9 obj_10 obj_14)
       (pred_9 obj_09 obj_26)
       (pred_9 obj_09 obj_27)
       (pred_9 obj_09 obj_10)
       (pred_9 obj_26 obj_16)
       (pred_9 obj_26 obj_09)
       (pred_6 obj_23)
       (pred_6 obj_16)
       (pred_6 obj_17)
       (pred_3  obj_23 obj_30)
       (pred_3  obj_16 obj_11)
       (pred_3  obj_17 obj_30)
       (pred_2 obj_02)
       (pred_2 obj_19)
       (pred_2 obj_25)
       (pred_2 obj_22)
       (pred_2 obj_20)
       (pred_2 obj_07)
       (pred_2 obj_28)
       (pred_2 obj_06)
       (pred_2 obj_05)
       (pred_2 obj_03)
       (pred_2 obj_12)
       (pred_2 obj_21)
       (pred_2 obj_15)
       (pred_2 obj_04)
       (pred_2 obj_13)
       (pred_2 obj_01)
       (pred_2 obj_08)
       (pred_2 obj_27)
       (pred_2 obj_14)
       (pred_2 obj_10)
       (pred_2 obj_09)
       (pred_2 obj_26)

       (pred_1  obj_29 obj_30)
       (pred_1  obj_24 obj_11)
       (pred_1  obj_18 obj_11)
       (pred_7 obj_29 obj_05)
       (pred_7 obj_24 obj_26)
       (pred_7 obj_18 obj_07)
       (pred_11 obj_26)
    )

    (:goal (and
       (pred_7 obj_29 obj_09)
    ))
(:constraints
  (always (not (pred_11 obj_27)))
)
)

; plan
1. (op_4 obj_26 obj_24)
   deleted: (pred_7 obj_24 obj_26) (pred_12)
   added: (pred_5 obj_24)
   goals met: 0 of 1
2. (op_2 obj_26 obj_16 obj_24 obj_11)
   deleted: (pred_6 obj_16)
   added: (pred_2 obj_16)
   goals met: 0 of 1
3. (op_1 obj_26 obj_16)
   deleted: (pred_11 obj_26)
   added: (pred_11 obj_16)
   goals met: 0 of 1
4. (op_1 obj_16 obj_04)
   deleted: (pred_11 obj_16)
   added: (pred_11 obj_04)
   goals met: 0 of 1
5. (op_1 obj_04 obj_05)
   deleted: (pred_11 obj_04)
   added: (pred_11 obj_05)
   goals met: 0 of 1
6. (op_5 obj_05 obj_29 obj_24)
   deleted: (pred_5 obj_24) (pred_7 obj_29 obj_05)
   added: (pred_5 obj_29) (pred_7 obj_24 obj_05)
   goals met: 0 of 1
7. (op_1 obj_05 obj_04)
   deleted: (pred_11 obj_05)
   added: (pred_11 obj_04)
   goals met: 0 of 1
8. (op_1 obj_04 obj_16)
   deleted: (pred_11 obj_04)
   added: (pred_11 obj_16)
   goals met: 0 of 1
9. (op_1 obj_16 obj_26)
   deleted: (pred_11 obj_16)
   added: (pred_11 obj_26)
   goals met: 0 of 1
10. (op_1 obj_26 obj_09)
   deleted: (pred_11 obj_26)
   added: (pred_11 obj_09)
   goals met: 0 of 1
11. (op_3 obj_09 obj_29)
   deleted: (pred_5 obj_29)
   added: (pred_12) (pred_7 obj_29 obj_09)
   goals met: 1 of 1
